package homework.homework1;

public class HomeWork1 {
//    1.
//    конфеты
//
//    У маши было 12 конфет, у миши было 10 конфет, у саши - 2, у павло - ни одной.
//    Маша и миша отдали, соответственно, саше и кеше по 3 конфеты. Посчитать и вывести, сколько конфет стало у каждого
//
//2. драйв
//    Авто ехало 3 часа, со скоростью 60 км/ч. Найти расстояние и вывести на экран
//
//3. майнкрафт
//    Известно, что стороны у прямоугольника равны 5 и 7. Найти площадь и периметр и вывести результат на экран
//
//4. магазин.
//    мама отправила сына в магазин за хлебом и молоком. Создать две булевые переменные хлеб и молоко. isHasebleMIlk - молоко isHasebleBread - хлеб
//    Если в магазине был и хлеб и молоко то мама должна похвалить сына и сказать "молодец сынок, купил и хлеб и молоко!"
//    Если в магазине был или хлеб и молоко, то мама говорит - "молодец сынок купил хоть, что-то"
//            *примечание после этого код, где содержится "молодец сынок купил хоть, что-то" нужно закомментировать, чтобы отработали следующие строчки
//    Если в магазине был только хлеб, то мама говорит - "молодец сынок купил хлеб"
//    Если в магазине было только молоко, то мама говорит - "молодец сынок купил молоко"
//    Если в магазине не было нечего, то мама говорит "ты не молодец сынок, ничего не купил
//
//            5. задание со звездочкой

    //Компания Рога и Копыта производит мясные продукты.
    //Перечень производимых товаров :

    //Колбаса - стоимость 800 руб,
    //себестоимость при производстве меньше 1000 кг - 412руб,
    //себестоимость при производстве от 1000 до 2000 (не включая) - 408 руб
    //себестоимость при производстве от 2000кг - 404 руб
    //Ветчина - стоимость 350 руб
    //себестоимость при производстве - 275 руб

    //Шейка - стоимость 500 руб
    //себестоимость при производстве меньше 500кг - 311 руб
    //себестоимость при производстве больше или равно 500кг - 299 руб

    //Финансовые показатели
    //Доход компании считается как умножение стоимости на количество проданных кг
    //Расход компании считается как умножение себестоимости на количество проданных кг + миллион рублей
    //Прибыль до налогов считается как: доход - расход

    //Налоги считаются так:
    // прибыль до налогов больше 2_000_000, облагается ставкой 13%
    // прибыль до налогов больше 1_000_000 от 2_000_000, облагается ставкой 10%
    // прибыль до налогов меньше 1_000_000, облагается ставкой 8%
    //пример расчета налогов для прибыли до налогов 2_500_000:

    //1_000_000 - налог 80_000 - по ставке 8%
    //1_000_000 - налог 100_000 - по ставке 10%
    //500_000 - 65_000 - по ставке 13%
    //Итоговый налог: 80_000 + 100_000 + 65_000 = 245_000
    //Прибыль после налогов: прибыль до налогов - налог.

    //Необходимо создать универсальную систему расчетов прибыли после налогов,
    //Т.е на вход подаются данные по количеству произведенных продуктов
    // и печатается прибыль после налогов компании
    //Узнать прибыль после налогов, при продаже:
    //Колбасы 2000кг
    //Ветчины 8511кг
    //Шейки 6988кг
}
